# ####################################################################

#  Created by Genus(TM) Synthesis Solution 25.10-p002_1 on Sat Mar 28 15:39:14 +07 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design gaussian_filter

create_clock -name "clk" -period 4.0 -waveform {0.0 2.0} [get_ports clk]
set_load -pin_load 0.2 [get_ports o_href]
set_load -pin_load 0.2 [get_ports o_vsync]
set_load -pin_load 0.2 [get_ports {o_data[15]}]
set_load -pin_load 0.2 [get_ports {o_data[14]}]
set_load -pin_load 0.2 [get_ports {o_data[13]}]
set_load -pin_load 0.2 [get_ports {o_data[12]}]
set_load -pin_load 0.2 [get_ports {o_data[11]}]
set_load -pin_load 0.2 [get_ports {o_data[10]}]
set_load -pin_load 0.2 [get_ports {o_data[9]}]
set_load -pin_load 0.2 [get_ports {o_data[8]}]
set_load -pin_load 0.2 [get_ports {o_data[7]}]
set_load -pin_load 0.2 [get_ports {o_data[6]}]
set_load -pin_load 0.2 [get_ports {o_data[5]}]
set_load -pin_load 0.2 [get_ports {o_data[4]}]
set_load -pin_load 0.2 [get_ports {o_data[3]}]
set_load -pin_load 0.2 [get_ports {o_data[2]}]
set_load -pin_load 0.2 [get_ports {o_data[1]}]
set_load -pin_load 0.2 [get_ports {o_data[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports rst_n]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports i_href]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports i_vsync]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {i_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports o_href]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports o_vsync]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {o_data[0]}]
set_input_transition 0.1 [get_ports clk]
set_input_transition 0.1 [get_ports rst_n]
set_input_transition 0.1 [get_ports i_href]
set_input_transition 0.1 [get_ports i_vsync]
set_input_transition 0.1 [get_ports {i_data[15]}]
set_input_transition 0.1 [get_ports {i_data[14]}]
set_input_transition 0.1 [get_ports {i_data[13]}]
set_input_transition 0.1 [get_ports {i_data[12]}]
set_input_transition 0.1 [get_ports {i_data[11]}]
set_input_transition 0.1 [get_ports {i_data[10]}]
set_input_transition 0.1 [get_ports {i_data[9]}]
set_input_transition 0.1 [get_ports {i_data[8]}]
set_input_transition 0.1 [get_ports {i_data[7]}]
set_input_transition 0.1 [get_ports {i_data[6]}]
set_input_transition 0.1 [get_ports {i_data[5]}]
set_input_transition 0.1 [get_ports {i_data[4]}]
set_input_transition 0.1 [get_ports {i_data[3]}]
set_input_transition 0.1 [get_ports {i_data[2]}]
set_input_transition 0.1 [get_ports {i_data[1]}]
set_input_transition 0.1 [get_ports {i_data[0]}]
set_wire_load_mode "enclosed"
